{"Taylor Swift":{"about": "Taylor Alison Swift (born December 13, 1989) is an American singer-songwriter. An influential figure in popular culture, she is known for her autobiographical songwriting and artistic reinventions. Swift is the highest-grossing live music artist, the wealthiest female musician, and one of the best-selling music artists of all time."},"Drake":{"about": "Aubrey Drake Graham (born October 24, 1986) is a Canadian rapper, singer, and actor. He is credited with popularizing R&B sensibilities in hip-hop music. Drake first gained recognition by starring as Jimmy Brooks in the CTV Television Network teen drama series Degrassi: The Next Generation (2001–2008) and began his music career by independently releasing the mixtapes Room for Improvement (2006), Comeback Season (2007), and So Far Gone (2009) before signing with Young Money Entertainment"},"The Weeknd":{"about": "Abel Makkonen Tesfaye (Amharic: አቤል መኮንን ተስፋዬ; born February 16, 1990), known professionally as the Weeknd, is a Canadian singer-songwriter, record producer, and actor. Regarded as an influential figure in popular music, he is known for his light-lyric tenor vocal range and falsetto, as well as his alternative R&B sound. His accolades include four Grammy Awards, 20 Billboard Music Awards, 22 Juno Awards, six American Music Awards, three MTV Video Music Awards, and a Latin Grammy Award."},"Sabrina Carpenter":{"about": "Sabrina Annlynn Carpenter (born May 11, 1999) is an American singer, songwriter, and actress. She first gained prominence starring as Maya Hart on the Disney Channel series Girl Meets World (2014–2017). She signed with the Disney-owned Hollywood Records and achieved limited success with studio albums Eyes Wide Open (2015), Evolution (2016), Singular: Act I (2018), and Singular: Act II (2019)."},"Billie Eilish": {"about": "Billie Eilish Pirate Baird O'Connell (born December 18, 2001) is an American singer-songwriter and musician. Eilish first gained public attention in 2015 with her debut single Ocean Eyes, written and produced by her brother Finneas O'Connell. In 2017, she released her debut EP, Don't Smile at Me, which was commercially successful in various countries, including the US, UK, and Australia."},"Justin Bieber":{"about": "Justin Drew Bieber (born March 1, 1994)is a Canadian singer. Regarded as a prominent figure in contemporary popular music, he rose to fame in the late 2000s after being discovered on YouTube, and his debut extended play, My World (2009), was met with international recognition and established him as a teen idol."},"Ariana Grande":{"about": "Ariana Grande-Butera (born June 26, 1993) is an American singer, songwriter, and actress. Known for her four-octave vocal range, which extends into the whistle register, she is regarded as an influential figure in popular music. Publications such as Rolling Stone and Billboard have deemed Grande one of the greatest artists in history, while Time included her on its list of the world's 100 most influential people in 2016 and 2019."},"Travis Scott": {"about": "Jacques Bermon Webster II (born April 30, 1991), known professionally as Travis Scott (formerly stylized as Travi$ Scott), is an American rapper, singer, songwriter, and record producer. Scott has had five number-one hits on the U.S. Billboard Hot 100 chart, along with a total of over one hundred charting songs. In addition to ten Grammy Award nominations, he has won a Latin Grammy Award, Billboard Music Award, MTV Video Music Award, and several BET Hip Hop Awards.[9] Scott's musical style has been described as a blend between traditional hip-hop and lo-fi, and often characterized as ambient, drawing notable influence from rappers Kanye West and Kid Cudi. His stage name is derived from the latter's real name, Scott Mescudi, combined with the name of a favorite uncle."},"Bruno Mars":{"about": "Peter Gene Hernandez (born October 8, 1985), known professionally as Bruno Mars, is an American singer-songwriter and record producer. Regarded as a pop icon, he is known for his three-octave tenor vocal range, live performances, retro showmanship, and musical versatility. He is accompanied by his band, the Hooligans. Raised in Honolulu, Mars gained recognition in Hawaii as a child for his impersonation of Elvis Presley, before moving to Los Angeles in 2003 to pursue a musical career."},"Ed Sheeran":{"about": "Edward Christopher Sheeran (born 17 February 1991) is an English singer-songwriter. Born in Halifax, West Yorkshire, and raised in Framlingham, Suffolk, he began writing songs around the age of eleven. In early 2011, Sheeran independently released the extended play No. 5 Collaborations Project. He signed with Asylum Records the same year."},"Lady Gaga":{"about": "Stefani Joanne Angelina Germanotta (born March 28, 1986), known professionally as Lady Gaga, is an American singer, songwriter, and actress. Known for her image reinventions and versatility across the entertainment industry, she is an influential figure in popular music. With estimated sales of 124 million records, she is one of the best-selling music artists of all time. Publications such as Billboard and Rolling Stone have ranked her among the greatest artists in history."},"Linkin Park":{"about": "Linkin Park is an American rock band formed in Agoura Hills, California, in 1996. The band's current lineup consists of vocalist/rhythm guitarist/keyboardist Mike Shinoda, lead guitarist Brad Delson, DJ/turntablist Joe Hahn, bassist Dave Farrell, vocalist Emily Armstrong, and drummer Colin Brittain. The lineup for the band's first seven studio albums included lead vocalist Chester Bennington and drummer Rob Bourdon; after Bennington's death by suicide in July 2017, the band endured a seven-year hiatus, during which Bourdon chose to depart from the band. In September 2024, Linkin Park's reformation was announced along with the addition of Armstrong and Brittain."},"Eminem":{"about": "Marshall Bruce Mathers III (born October 17, 1972), known professionally as Eminem, is an American rapper, songwriter, and record producer. Widely regarded as one of the greatest and most influential rappers of all time, he is often credited with popularizing hip-hop in Middle America and breaking down racial barriers for the acceptance of white rappers in popular music. While much of his transgressive work during the late 1990s and early 2000s made him a controversial figure, Eminem has become a representation of popular angst of the American underclass and is noted for his conscious lyrics, with political criticism and social commentary, and skilled rap flow."},"Kendrick Lamar":{"about": "Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper, singer, songwriter, and record producer. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the award. Lamar's music, rooted in West Coast hip-hop, features conscious, introspective lyrics, with political criticism and social commentary concerning African-American culture."},"Coldplay":{"about": "Coldplay are a British rock band formed in London in 1997. They consist of vocalist and pianist Chris Martin, guitarist Jonny Buckland, bassist Guy Berryman and drummer Will Champion; manager Phil Harvey is also credited as a full member. The group are known for their live performances and have had a significant impact on popular culture."},"SZA":{"about": "Solána Imani Rowe (born November 8, 1989), known professionally as SZA, is an American singer-songwriter. Known for her diaristic lyrics and genre explorations, she is regarded as a prominent figure in influencing contemporary R&B music and popularizing alternative R&B."},"Tyler, The Creator ": {"about": "Tyler Gregory Okonma (born March 6, 1991), known professionally as Tyler, the Creator, is an American rapper, singer, songwriter, record producer, and actor. He has been described as an influential figure in alternative hip-hop during the 2010s and 2020s. In the late 2000s he led and co-founded the music collective Odd Future. Within the group, Tyler participated as a rapper, producer, director and actor, releasing studio albums that he produced for its respective members. Tyler also performed on the group's sketch comedy show Loiter Squad (2012–2014)." }, "Post Malone": { "about": "Austin Richard Post (born July 4, 1995), known professionally as Post Malone, is an American singer, rapper, songwriter, record producer, and actor. His music blends various genres including pop, hip-hop, trap, R&B, and country." }, "Imagine Dragons": { "about": "Imagine Dragons are an American pop rock band formed in 2008, based in Las Vegas, Nevada. The band currently consists of lead singer Dan Reynolds, guitarist Wayne Sermon, and bassist Ben McKee. They first gained exposure with the release of their single It's Time, followed by their debut album Night Visions (2012), which resulted in the chart-topping singles Radioactive and Demons. Rolling Stone named Radioactive, which held the record for most weeks charted on the Billboard Hot 100, the biggest rock hit of the year. MTV called them the year's biggest breakout band, and Billboard named them their Breakthrough Band of 2013 and Biggest Band of 2017, and placed them at the top of their Year in Rock rankings for 2013,[9] 2017,[10] and 2018.[11] Imagine Dragons topped the Billboard Year-End \"Top Artists – Duo/Groupcategory in 2018.\"" }, "Dua Lipa": { "about": "Dua Lipa (born 22 August 1995) is an English singer and songwriter. Her accolades include seven Brit Awards and three Grammy Awards." }, "Juice WRLD": { "about": "Jarad Anthony Higgins (December 2, 1998 – December 8, 2019), known professionally as Juice Wrld (pronounced \"juice world\"; stylized as Juice WRLD), was an American rapper, singer, and songwriter. He emerged as a leading figure in the emo and SoundCloud rap genres, which garnered mainstream attention during the mid-to-late 2010s.[3][4] His stage name, which he said represents \"taking over the world\", was derived from the crime thriller film Juice (1992)." }, "The Neighbourhood": { "about": "The Neighbourhood (abbreviated as the nbhd) is an American alternative rock band formed in Newbury Park, California, in 2011. The band is composed of vocalist Jesse Rutherford, guitarists Jeremy Freedman and Zach Abels, bassist Mikey Margott and drummer Brandon Fried. After releasing two EPs, I'm Sorry... and Thank You, the Neighbourhood signed with Columbia Records to release their debut studio album, I Love You. (2013). \"Sweater Weather\", the album's third single, became their sole entry on the Billboard Hot 100—peaking at number 14—and re-surged in popularity nearly a decade later on radio airplay and Spotify.[1][2] Other notable hits from the band include \"Afraid\", \"Daddy Issues\", \"Softcore\", \"You Get Me So High\", \"Reflections\" and \"The Beach\"." }, "Artic Monkeys": { "about": "Arctic Monkeys are an English rock band formed in Sheffield in 2002. They comprise lead singer and guitarist Alex Turner, drummer Matt Helders, guitarist Jamie Cook and bassist Nick O'Malley. The co-founder and original bassist Andy Nicholson left in 2006. Though initially associated with the short-lived landfill indie movement, Arctic Monkeys were one of the earliest bands to come to public attention via the Internet, during the emerging \"blog rock\" era. Commentators have suggested that this period marked a shift in how new bands were promoted and marketed." }, "Olivia Rodrigo": { "about": "Olivia Isabel Rodrigo (born February 20, 2003) is an American singer-songwriter and actress. She began her career as a child, appearing in commercials and the direct-to-video film An American Girl: Grace Stirs Up Success (2015). She rose to prominence for her leading roles in the Disney Channel series Bizaardvark (2016–2019) and the Disney+ series High School Musical: The Musical: The Series (2019–2022)." }, "Twenty One Pilots": { "about": "Twenty One Pilots is an American musical duo from Columbus, Ohio. The group was formed in 2009 by lead vocalist Tyler Joseph along with Nick Thomas and Chris Salih, who both left in 2011. Since their departure, the line-up has consisted of Tyler Joseph and drummer Josh Dun. The duo is best known for their singles \"Stressed Out\", \"Ride\", and \"Heathens\", which achieved commercial success between 2015 and 2016. The duo received a Grammy Award for Best Pop Duo/Group Performance at the 59th Annual Grammy Awards for \"Stressed Out\"." }, "Calvin Harris": { "about": "Adam Richard Wiles (born 17 January 1984), known professionally as Calvin Harris (and sometimes under the stage name Love Regenerator), is a Scottish DJ, record producer, singer, and songwriter. His debut studio album, I Created Disco (2007) was preceded by the singles \"Acceptable in the 80s\" and \"The Girls\", both of which achieved commercial success in Europe, as well as in Australia. His second album, Ready for the Weekend (2009), debuted atop the official albums charts in his native Scotland, as well as in the United Kingdom, and its lead single, \"I'm Not Alone\", became his first song to reach number one in the UK Singles Charts." }, "Benson Boone": { "about": "Benson James Boone (born June 25, 2002) is an American singer-songwriter. He began his music career by briefly competing on American Idol in early 2021 before withdrawing voluntarily. He continued to gain popularity on TikTok and subsequently signed a contract with Dan Reynolds's Night Street Records label and released the singles, \"Ghost Town\" and \"In the Stars\" in 2021 and 2022 respectively, which garnered him recognition." }, "Queen": { "about": "Queen are a British rock band formed in London in 1970 by Freddie Mercury (lead vocals, piano), Brian May (guitar, vocals), and Roger Taylor (drums, vocals), later joined by John Deacon (bass). Their earliest works were influenced by progressive rock, hard rock and heavy metal, but the band gradually ventured into more conventional and radio-friendly works by incorporating further styles, such as arena rock and pop rock." }, "J. Cole": { "about": "Jermaine Lamarr Cole (born January 28, 1985) is an American rapper and record producer. Born in a military base in Germany and raised in Fayetteville, North Carolina, Cole initially gained attention as a rapper following the release of his debut mixtape, The Come Up, in early 2007. Intent on further pursuing a musical career, he signed with Jay-Z's Roc Nation in 2009 and released two additional mixtapes: The Warm Up (2009) and Friday Night Lights (2010) to further critical acclaim as he garnered a wider following." }, "Hozier": { "about": "Andrew John Hozier-Byrne (born 17 March 1990), known professionally as Hozier, is an Irish musician. His music primarily draws from folk, soul and blues, often using religious and literary themes and taking political or social justice stances." }, "OneRepublic": { "about": "OneRepublic is an American pop rock band formed in Colorado Springs, Colorado, in 2002. The lineup currently consists of Ryan Tedder (lead vocals, piano), Zach Filkins (guitar, viola), Drew Brown (guitar), Brent Kutzle (bass, cello), Eddie Fisher (drums), and Brian Willett (keyboards, percussion, violin)." }, "Shawn Mendes": { "about": "Shawn Peter Raul Mendes (born August 8, 1998) is a Canadian singer, songwriter, and musician. He gained a following in 2013 when he posted song covers on the video-sharing platform Vine. The following year, he caught the attention of artist manager Andrew Gertler and Island Records A&R Ziggy Chareton, which led to his signing a deal with the record label. Mendes's self-titled debut EP was released in 2014, followed by his debut studio album Handwritten in 2015. Handwritten debuted atop the US Billboard 200, making Mendes one of five artists ever to debut at number one before the age of 18. The single \"Stitches\" reached number one in the UK and the top 10 in the US and Canada." }, "Harry Styles": { "about": "Harry Edward Styles (born 1 February 1994) is an English singer, songwriter, and actor. His showmanship, artistry, and flamboyant fashion have had a significant impact on popular culture." }, "Miley Cyrus": { "about": "Miley Ray Cyrus (born Destiny Hope Cyrus; November 23, 1992) is an American singer, songwriter, and actress. An influential figure in popular music, Cyrus is known for her evolving artistry and image reinventions. A daughter of Billy Ray Cyrus and Tish Cyrus, she was an established child star before developing a successful entertainment career as an adult. Cyrus emerged as a teen idol as Miley Stewart in the Disney Channel television series Hannah Montana (2006–2011), growing a profitable franchise and achieving two number-one soundtracks on the Billboard charts." }, "Nirvana": { "about": "Nirvana was an American rock band formed in Aberdeen, Washington, in 1987. Founded by lead singer and guitarist Kurt Cobain and bassist Krist Novoselic, the band went through a succession of drummers, most notably Chad Channing, before recruiting Dave Grohl in 1990. Nirvana's success popularized alternative rock, and they were often referenced as the figurehead band of Generation X.[ Their music maintains a popular following and continues to influence rock culture." }, "Oasis": { "about": "Oasis are an English rock band formed in Manchester in 1991. The group initially consisted of Liam Gallagher (lead vocals), Paul \"Bonehead\" Arthurs (guitar), Paul \"Guigsy\" McGuigan (bass guitar) and Tony McCarroll (drums). Liam asked his older brother Noel Gallagher (lead guitar, vocals) to join as a fifth member a few months later to finalise their formation. Noel became the de facto leader of the group and took over the songwriting duties for the band's first four studio albums. They are regarded as the most globally successful group of the Britpop genre." }, "Lewis Capaldi": { "about": "Lewis Marc Capaldi (born 7 October 1996) is a Scottish singer-songwriter and musician. In March 2019, his single \"Someone You Loved\" (2018) topped the UK Singles Chart where it remained for seven weeks, and in November 2019, it reached number one on the US Billboard Hot 100; it was nominated at the 62nd Annual Grammy Awards for Song of the Year and won the 2020 Brit Award for Song of the Year. \"Someone You Loved\" was the bestselling single of 2019 in the UK. He was nominated for the Critics' Choice Award at the 2019 Brit Awards. Capaldi also won the 2020 Brit Award for Best New Artist. In May 2020, it was announced that Capaldi's song \"Someone You Loved\" had become the longest-running top 10 UK single of all time by a British artist." }, "The Kid LAROI": { "about": "Charlton Kenneth Jeffrey Howard (born 17 August 2003), known professionally as the Kid Laroi (stylised as the Kid LAROI), is an Australian singer-songwriter, and rapper. He was first discovered by Triple J Unearthed in 2016 at the age of 13. As he gained a wider following, he was led to sign with Lil Bibby's Grade A Productions, in a joint venture with Columbia Records. He saw his furthest mainstream recognition for his 2021 single \"Stay\" (with Justin Bieber), which peaked atop the charts in numerous countries including his native Australia, as well as the Canadian Hot 100 and Billboard Hot 100." }, "The Chainsmokers": { "about": "The Chainsmokers are an American electronic DJ and production duo consisting of Alex Pall and Drew Taggart. They started out by releasing remixes of songs by indie artists. The EDM-pop duo achieved a breakthrough with their 2014 song \"#Selfie\", which became a top-twenty single in several countries. They have won a Grammy Award, two American Music Awards, seven Billboard Music Awards and nine iHeartRadio Music Awards. According to Forbes' 2019 list of highest-paid celebrities, the Chainsmokers were the highest-paid DJs, dethroning Calvin Harris after six years." }, "Avicii": { "about": "Tim Bergling (8 September 1989 – 20 April 2018), known professionally as Avicii,[b] was a Swedish DJ, remixer, and record producer. At age 16, he began posting his remixes on electronic music forums, which led to his first record deal.[2] He rose to prominence in 2011 with his single \"Levels\". His debut studio album, True (2013), blended electronic music with elements of multiple genres and received generally positive reviews. It peaked in the top 10 in more than 15 countries and topped international charts; the lead single, \"Wake Me Up\", topped most music markets in Europe and reached number four in the United States." }, "Jung Kook": { "about": "Jeon Jung-kook (Korean: 전정국; born September 1, 1997), known mononymously as Jung Kook, is a South Korean singer and songwriter. He rose to prominence as a member and vocalist of South Korean boy band BTS. He has performed three solo songs as part of BTS' discography— \"Begin\" in 2016, \"Euphoria\" in 2018, and \"My Time\" in 2020—all of which charted on South Korea's Gaon Digital Chart. He also recorded the soundtrack song \"Stay Alive\" for the BTS-based webtoon 7Fates: Chakho." }, "James Arthur": { "about": "James Andrew Arthur (born 2 March 1988) is an English singer and songwriter. He rose to fame after winning the ninth series of The X Factor in 2012. His debut single, a cover of Shontelle's \"Impossible\", was released by Syco Music after the final, and debuted at number 1 on the UK Singles Chart. Since then, it has gone on to sell over 2.5 million copies worldwide, making it the most successful winner's single in the show's history." }, "DJ Snake": { "about": "William Sami Étienne Grigahcine (born 13 June 1986), known by his stage name DJ Snake, is an Algerian-French record producer and DJ. He was first credited with production work on several singles for other artists—including \"Shut It Down\" by Pitbull and \"Applause\" by Lady Gaga—before gaining widespread recognition for his 2013 debut single, \"Turn Down for What\" (with Lil Jon)." }, "Lord Huron": { "about": "Lord Huron is a Los Angeles-based American indie rock band composed of Mark Barry (drums, percussion), Miguel Briseño (bass, keyboard, theremin), Tom Renaud (guitar), and founder Ben Schneider (guitar, lead vocals). They released their debut album Lonesome Dreams in 2012, their second album Strange Trails in 2015, their third album Vide Noir in 2018, their fourth album Long Lost in 2021, and their fifth album The Cosmic Selector Vol. 1 in 2025." }, "Tom Odell": { "about": "Thomas Peter Odell (born 24 November 1990) is an English singer-songwriter. His debut extended play Songs from Another Love was released in 2012, earning him a BRITs Critics' Choice Award. He has won an Ivor Novello Award for Songwriter of the Year in 2014. His debut studio album, Long Way Down, was released on 24 June 2013, and was followed by his second album, Wrong Crowd, on 10 June 2016. Odell went on to release Jubilee Road (2018) and Monsters (2021), both through Columbia Records. In 2022, he became an independent artist and released two more studio albums: Best Day of My Life (2022) and Black Friday (2024), the latter featuring the breakout track \"Black Friday\" which became one of his most successful singles to date." }, "The Police": { "about": "The Police were an English rock band formed in London in 1977. Their core line-up comprised Sting (lead vocals, bass, primary songwriter), Andy Summers (guitar) and Stewart Copeland (drums, percussion). The Police became globally popular from the late 1970s to the mid-1980s. Emerging in the British new wave scene, they played a style of rock influenced by punk, reggae, and jazz." }, "The Killers": { "about": "The Killers are an American rock band formed in Las Vegas, Nevada, in 2001 by Brandon Flowers (lead vocals, keyboards, bass) and Dave Keuning (lead guitar, backing vocals). After the band went through a number of short-term bassists and drummers, Mark Stoermer (bass, rhythm guitar, backing vocals) and Ronnie Vannucci Jr. (drums, percussion) joined in 2002." }, "The Goo Goo Dolls": { "about": "The Goo Goo Dolls are an American rock band based in Buffalo, New York, composed of lead vocalist and guitarist John Rzeznik, bassist and vocalist Robby Takac, as well as several rotating members since its formation in 1986." }, "Macklemore": { "about": "Benjamin Hammond Haggerty (born June 19, 1983), better known by his stage name Macklemore (formerly Professor Macklemore), is an American rapper. A native of Seattle, Washington, he started his career in 2000 as an independent artist releasing: Open Your Eyes (2000), The Language of My World (2005), and The Unplanned Mixtape (2009). He rose to international success collaborating with producer Ryan Lewis as the duo Macklemore & Ryan Lewis (2009–2016)." }, "Glass Animals": { "about": "Glass Animals are a British indie rock band formed in Oxford, England in 2010. The band's line-up consists of Dave Bayley (vocals, guitar, keyboards, drums, songwriting), Drew MacFarlane (guitar, keyboards, backing vocals), Edmund Irwin-Singer (bass, keyboards, backing vocals), and Joe Seaward (drums)." }, "Vance Joy": { "about": "James Gabriel Keogh (born 1 December 1987), known professionally as Vance Joy, is an Australian singer, songwriter, musician, and former Australian rules footballer. He is best known for his 2013 hit song \"Riptide\"." }, "John Legend": { "about": "John Roger Stephens (born December 28, 1978), known professionally as John Legend, is an American singer, songwriter, pianist, and record producer. He began his musical career working behind the scenes for other artists, playing piano on Lauryn Hill's \"Everything Is Everything\", and performing as an uncredited backing vocalist on Jay-Z's \"Encore\" and Alicia Keys' \"You Don't Know My Name\". He was the first artist to sign with rapper Kanye West's GOOD Music, through which he released his debut studio album, Get Lifted (2004). Preceded by the hit ballad \"Ordinary People\", the album reached the top ten of the Billboard 200 and received double platinum certification by the Recording Industry Association of America (RIAA)." }, "French Montana": { "about": "Karim Kharbouch (born November 9, 1984), known professionally as French Montana, is a Moroccan and American rapper. Born and raised in Morocco, he immigrated to New York City with his family at the age of 13 and began his career as a battle rapper in the early 2000s — under the name Young French." }, "Journey": { "about": "Journey is an American rock band formed in San Francisco in 1973 by former members of Santana, the Steve Miller Band, and Frumious Bandersnatch. The band as of 2025 consists of Neal Schon on guitars and vocals (the last remaining original member); Jonathan Cain on keyboards, guitars and vocals; Deen Castronovo on drums and vocals; Arnel Pineda on lead vocals; Jason Derlatka on keyboards and vocals; and Todd Jensen on bass." }, "a-ha": { "about": "A-ha are a Norwegian synth-pop band formed in Oslo in 1982. Founded by Paul Waaktaar-Savoy (guitars and vocals), Magne Furuholmen (keyboards, guitars and vocals), and Morten Harket (lead vocals), the band rose to fame during the mid-1980s." }, "Tones and I": { "about": "Toni Watson, known professionally as Tones and I, is an Australian singer, songwriter, and record producer. She is best known for her breakout single \"Dance Monkey\", which reached number one in over 30 countries including her home country Australia. In 2019–20, \"Dance Monkey\" completed 24 weeks at number one on the Australian singles chart, beating Bing Crosby's all-time Australian record for his version of \"White Christmas\", which spent an equivalent of 22 weeks at the top in 1943. \"Dance Monkey\" was certified 19× platinum by ARIA for shipments of over 1,330,000 units by June 2023." }, "The All-American Rejects": { "about": "The All-American Rejects (often abbreviated as AAR) are an American rock band formed in Stillwater, Oklahoma, in 1999. The band consists of lead vocalist and bassist Tyson Ritter, lead guitarist and backing vocalist Nick Wheeler, rhythm guitarist and backing vocalist Mike Kennerty, and drummer Chris Gaylor. Wheeler and Ritter serve as the band's songwriters; Wheeler is the primary composer and Ritter is the primary lyricist. Although Kennerty and Gaylor are not founding members, they have appeared in all of the band's music videos and on all studio releases except for the band's self-titled debut." }, "Passenger": { "about": "Michael David Rosenberg (born 17 May 1984), better known by his stage name Passenger, is an English indie folk singer, songwriter and musician. From 2000s, Rosenberg fronted a band by the same name; he opted to keep the Passenger moniker for his solo work after the band dissolved. Rosenberg is best known for the 2012 song \"Let Her Go\", which topped the charts in 16 countries and accumulated more than 3.9 billion views on YouTube. Because Rosenberg was based in Australia at the time of release (and the clip itself was filmed at the Factory Theatre in Marrickville), it is the most-viewed Australian YouTube video ever. In 2014, the song was nominated for the Brit Award for British Single of the Year, and he received the British Academy's Ivor Novello Award for Most Performed Work." }, "Bella Kay": { "about": "An Alternative/Indie artist, who's most popular release is \"The Sick\"." }, "PsychoYP": { "about": "Nicholas Ihua-Maduenyi (born 28 October 1998), widely known as PsychoYP, is a Nigerian alternative hip hop rapper, singer, and songwriter. He is a member of the music collective Apex Village. He came into the music scene with a critically acclaimed mixtape, YPSZN, which earned him a nomination at the SAMAs, and the Headies for his second fit album YPSZN2. Dubbed \"The Fresh Prince of Nigerian Rap\", he is regarded as one of Nigeria's rap music pioneers in the alté music scene." }, "Frankie Muriel": { "about": "Frankie Muriel was never just playing rock and roll - he was living it. From sneaking into his father’s late-night jam sessions to lighting up MTV as the frontman of KINGOFTHEHILL, his story has always been one of sound, soul, and reinvention. When the glam era faded, he didn’t. He built Dr. Zhivegas from the ground up, turning it into a 30-year dance-rock machine that never stopped moving." }, "The Hourglass Effect": { "about": "The Hourglass Effect blends Southern roots with rock and blues into a lush collection of feel-good tunes by songwriter Drew Brashear and multi-instrumentalist David Hardman featuring Erin Fox-Clough on vocals." }, "Laime": { "about": "Step into the realm of Nigerian musical brilliance with Onisolaime 'Laime' Bennibor! Hailing from the heart of Port Harcourt, Nigeria. Artist Laime weaves together Afro fusion that promise an enthralling auditory adventure." }, "Nick Broadhurst": { "about": "Nick Broadhurst is an Australian singer, songwriter and producer whose work sits at the intersection of scale and simplicity. He writes in plain language, then sets those words inside immersive, cinematic production, moving between bare piano and voice, textural electronics, and the life of layered synths. He also releases under the pop-leaning alias enobe, a space where his precision electronica and widescreen synth instincts come to the front. What anchors it all is a direct, emotionall present vocal." }, "Terry Parks": { "about": "Heartfelt Media Group (HMG) is simply and sincerely as it sounds. This creative and collaborative media production association has decades of close involvement together in a wariety of original musical creations and stylings, as well as video and other visual artistry. It all comes not only from the mind, but very deeply from the heart. The clear primary purpose of HMG is to honor and serve God, pleasing Him through our gifts He's given us, and in faithfully doing so to bless, move, encourage, teach and builld up all those we can." }, "Maithili Raelle": { "about": "Maithili Raelle was born to touch nations with her voice. The NYU student has lived and breathed music since she could form words. While her sweet, breathy delivery enchants listeners, it is her ability to tap into both her deeper and higher whistle registers with a bold impact that is garnering industry attention. It makes sense, as she counts such powerhouse greats as Ariana Grande, Mariah Carey, and Whitney Houston among her influences." }, "Misfit Milli": { "about": "Enter MISFIT MILLI—a bold, genre-bending creative force whose energy is reshaping the sound of Generation Z. In 2025, her voice isn't just being heard; it's being demanded. With her runaway hit “2AM (Body)”, produced by sonic architect GENIEMIXEDIT, MISFIT MILLI has carved her name into the future of music." }, "Keith Rayburn": { "about": "Singer-songwriters Craig and Keith Rayburn bring a broad range of influences to their music. Hailing from the Monterey Bay, they play songs that are a mix of folk, rock and Americana. Their voices harmonize as only brothers can, with graceful melodies, poignant singing and deft instrumentation. The Rayburn Brothers Band has created a brand of California folk-rock that has depth and energy. Their songs convey the essence of love, longing and pain that only seasoned songwriters can express in such heartfelt terms. The Rayburn Brothers sing from the soul, touching in their audiences a chord of the human experience. Brothers Craig and Keith Rayburn grew up making music near the chaparral covered hills of L.A. Now they call the redwood canyons and crashing waves of Santa Cruz home." }, "SEHORE": { "about": "Sehore is an emerging artist who made his debut in 2025. His first album, Ladencia, was recorded at Paco Loco Studio and mastered in Kadifornia by Mario G. Alberni. Released by MusicHunters Records, this work introduces a unique and experimental sound. Sehore’s songs blend classic harmonic progressions with unexpected dissonances. The result is a fresh and surprising sonic experience. The artist does not limit himself to emulating a specific era but instead creates a mix of rhythms and atmospheres, giving life to a recognizable and original musical identity. His style stands out for its ability to evoke contrasting emotions, between melancholy and vibrant energy." }, "Michael Day Walston": { "about": "Michael Day Walston is a Los Angeles-born musician who masterfully blends the energy of modern rock with the timeless influences of classic bands like the Allman Brothers, Lynyrd Skynyrd, the Eagles, and The Doobie Brothers. Growing up with a deep appreciation for Motown and classic rock, Walston chennels those roots into a fresh, contemporary sound that bridges the past and present." }, "Steinsdotter": { "about": "After making a name for herself in the dance and alternative music scenes, London-based artist Steinsdotter expands her reach into meditation music. Steinsdotter’s venture into this genre is not just a side project, but a deliberate exploration of the healing power of sound. Her latest works, part of her Full Moon Series, demonstrate a profound commitment to creating music that transcends conventional boundaries. Each release is meticulously crafted to resonate with specific frequencies and emotions, inviting listeners on a journey of inner exploration and transformation. " }, "Alex Ray": { "about": "By the mid 1980's, Country Music had largely evolved away from singing cowboys, and 'Old Troubadours', toward a younger, fresher look, more commercialized, and with a wider variety of sound, and appeal. Coming onto the music scene in the late 80's, Alex gravitated toward those Country artists with a 'Rock' edge, including bands like Restless Heart, and Southern Pacific." }}